<?php
    //      4章 3
    /* ------------------------------------------------
     *   次のコードが２つの配列を作成しています。
     *      コードが正しく実行されるとき、空欄１・２に入る演算子の組み合わせとして
     *      適切なものを選択してください。（１つ選択）
     * ------------------------------------------------ */
    /* ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━
     *   配列への代入時の演算子
     *     $colors['sea'] ( 1 ) 'blue';
     *     $colors['leaf'] ( 1 ) 'green';
     *     $colors['night'] ( 1 ) 'black';
     * 
     *     $scores = array('国語' ( 2 ) 80,
     *                     '数学' ( 2 ) 90,
     *                     '英語' ( 2 ) 75);
    * ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ */

    $colors['sea'] = 'blue';
    $colors['leaf'] = 'green';
    $colors['night'] = 'black';
    foreach($colors as $col){
        print '$col = '.$col."\n\r";
    }

    print "\n\r";

    $scores = array('国語' => 80,
                    '数学' => 90,
                    '英語' => 75);

    foreach($scores as $sco){
        print '$sco = '.$sco."\n\r";
    }
?>