<?php
    //      補足
    /* ------------------------------------------------
     *   パースエラー：構文エラー
     * ------------------------------------------------ */
    /* ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━
     *  Parse error: syntax error, unexpected token "echo" in 
     *      C:\xampp\htdocs\php_202304\kuro\chapter99_01.php on line 15
     * 
     *      意味：構文エラー発生！（ファイル名・行数の付近に・・・）
     * ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ */
    
    $msg = "パースエラー"

    echo $msg;
?>