<?php
    //      3章 6
    /* ------------------------------------------------
     *   次のコードを実行した結果として
     *       正しいものを選択してください（１つ選択）
     * ------------------------------------------------ */
    /* ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━
     *  strcmp()　：　２つの文字列を辞書順で比較
     *      １番目の文字列が２番目の文字列より
     *          大きい　->　「+」正の数
     *          小さい　->  「-」負の数
     *          等しい　->  「0」
     *  ---------------------------------
     *      文字列の数は、
     *          値の大小ではなく、１文字目で比較
     * ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ */

    if(strcmp("54321" , "6789") > 0){
        print "Over";
    }else{
        print "Under";
    }

    echo "\r\n ************************ \r\n";

    $str1 = "54321";
    $str2 = "6789";

    echo '$str1 = '.$str1."\r\n";
    echo '$str2 = '.$str2."\r\n";
    echo 'strcmp($str1,$str2) = '.strcmp($str1,$str2);

?>