<?php
    //      3章 3
    /* ------------------------------------------------
     *   次のコードを実行した結果として
     *       正しいものを選択してください（１つ選択）
     * ------------------------------------------------ */
    /* ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━
     *  文字列 == 数値　・・・　型の比較は無し
     *  文字列 === 数値 ・・・  型の比較も行う
     * ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ */

    $data = '10';

    if($data == 10){
        print "1";
    }else{
        print "2";
    }

    echo "\r\n";
    
    $data = '10';
    echo "「===」で比較すると… ";
    if($data === 10){
        print "true";
    }else{
        print "false";
    }
?>