<?php
    //      4章 10
    /* ------------------------------------------------
     *   var_dump()関数を実行すると次のように表示される
     *      ２次元配列があります。この２次元配列を作成するための記述として
     *      正しいものを選択してください。（２つ選択）
     * ------------------------------------------------ */
    /* ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━
     *   配列記述書式
     *      $変数名　=　array();
     * 
     *  ---------------------------------------------------
     * 
     *      $変数名　=　array(
     *                  　'１つ目のkey XXX'　=>　array( ),
     *                  );
     * ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ */

    print ("\n\r ━…━… A ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r");
    //  　[apple][banana]のkey が未設定 
    $arraya = array(
        array('color' => 'red', 'stock' => 1000),
        array('color' => 'yellow', 'stock' => 2000),
    );
    print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
    print var_dump($arraya);
    print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";

    // print ("\n\r ━…━… B ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r");
    // //  　「array」の記述位置NG
    // $arrayb = array(
    //     ('color' => 'red', 'stock' => 1000),
    //     ('color' => 'yellow', 'stock' => 2000),
    // );
    // print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
    // print var_dump($arrayb);
    // print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";

    // print ("\n\r ━…━… C ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r");
    // //  　「array」の記述位置NG
    // $arrayc[][] = 'apple' => array('color' => 'red', 'stock' => 1000),
    //               'banana' => array('color' => 'yellow', 'stock' => 2000);
    // print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
    // print var_dump($arrayc);
    // print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";

    print ("\n\r ━…━… D ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r");
    $arrayd['apple']['color'] = 'red';
    $arrayd['apple']['stock'] = 1000;
    $arrayd['banana']['color'] = 'yellow';
    $arrayd['banana']['stock'] = 2000;
    print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
    print var_dump($arrayd);
    print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
    
    print ("\n\r ━…━… E ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r");
    $arrays = array('apple' => array('color' => 'red','stock' => 1000),
                    'banana' => array('color' => 'yellow','stock' => 2000),
            );
    print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
    print var_dump($arrays);
    print " ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ \n\r";
?>