<?php
    //      4章 6
    /* ------------------------------------------------
     *   次のコードを実行した結果として
     *      正しいものを選択してください。（１つ選択）
     * ------------------------------------------------ */
    /* ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━
     *   asort 値を並べ替え（昇順）
     *      Key と 値の関係は保持
     * ━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━…━ */

    $colors['sea'] = 'blue';
    $colors['leaf'] = 'green';
    $colors['night'] = 'black';
    $colors['sun'] = 'red';

    asort($colors);
    foreach($colors as $key => $value){
        print " $key \t : $value \n <br>";
    }
?>