<?php
    /** sample6_05.php を編集 **/
class Animals{
    // プロパティ（クラス内の変数）
    public $name;

    /**
     *  コンストラクタ
     */
    public function __construct($name){
        $this->name = $name;
    }

    /**
     *  メソッド：動作
     *  「（生き物）が（動作）する」 
     */
    public function dosa($_suru){
        return $this->name."が".$_suru."。";
    }
}

/** ---------------------
 *  クラス：Animals_sub
 *  継承元：Animals
 *  --------------------- **/
class Animals_sub extends Animals{
    /**
     *  メソッド：餌
     */
    public function esa(){
        return "今がチャンス！".$this->name."に餌をあげよう。";
    }
}

// /* -----------------------------------------------------
// *   生き物の動き（１）
// *       生き物：犬
// *       動作：歩く
// * ----------------------------------------------------- */
//     $dog = new Animals("犬");
//     echo $dog->dosa("歩く");

/* -----------------------------------------------------
*   生き物の動き（２）
*       生き物：猫
*       動作：寝る　→　寝ている
* ----------------------------------------------------- */
    $cat = new Animals("猫");
    echo $cat->dosa("寝ている★");

    echo "\r\n ******************** \r\n";
/* -----------------------------------------------------
*   生き物の動き（３）
*       生き物：ハムスター
*       動作：出てきた
* ----------------------------------------------------- */
    $hamster = new Animals_sub("ハムスター");
    echo $hamster->dosa("出てきた");
    echo $hamster->esa();
?>