<?php

class Test{
    //--  静的メソッド(static)　--//
    public static function demo(){
        echo "静的メソッドのテストです。\r\n";
    }

    public function lesson(){
        echo "動的メソッドです。\r\n";
    }
}

/* -----------------------------------------------------
*   インスタンス化せずに呼び出し可能
*   「static」があれば…
* ----------------------------------------------------- */
    Test::demo();
    print "\r\n";

    /**
     *  「static」の無い関数を呼び出す場合は
     *      インスタンスが必要
     */
    // Test::lesson();

/* -----------------------------------------------------
*    インスタンス化しても呼び出し可能
* ----------------------------------------------------- */
    $case1 = new Test();
    print '$case1 '."\r\n";
    $case1->demo();
    $case1->lesson();
?>